[
  {
    _id: "68edc2d27643e3d5ce5ea719",
    courseId: "68e609e49e158e162999fa2c",
    chapter: "3",
    stimulusType: "text",
    stimulusContent:
      "মামুন জয়পুরহাট থেকে ঢাকা যাওয়ার জন্য (112)_8_ টাকার টিকিট কিনল। মামুনের বন্ধু আবির নারায়ণগঞ্জ থেকে ঢাকা আসার জন্য (3D)_16_ টাকায় টিকিট কিনল। _কু-23_",
    questions: [
      {
        question:
          "মামুন ও আবির মোট কত টাকার টিকিট কিনল তা বাইনারিতে প্রকাশ কর।",
        marks: 3,
      },
      {
        question:
          "মামুন আবিরের টিকিটের ক্রয়মূল্যের পার্থক্য যোগের মাধ্যমে নির্ণয় সম্ভব- বিশ্লেষণ কর।",
        marks: 4,
      },
    ],
    createdAt: "2025-10-14T03:26:10.923Z",
    updatedAt: "2025-10-16T03:41:42.132Z",
  },
  {
    _id: "68edc4117643e3d5ce5ea71a",
    courseId: "68e609e49e158e162999fa2c",
    chapter: "3",
    stimulusType: "text",
    stimulusContent:
      "রনি এবং জনি এবারের একুশের বইমেলা থেকে যথাক্রমে (346)_8_  এবং (10110110)_2_ টাকার বই কিনেছিল? _ঢা-23_",
    questions: [
      {
        question:
          "উদ্দীপকের রনি এবং জনি মোট কত টাকার বই কিনেছিল তা ডেসিমেল পদ্ধতিতে নির্ণয় কর।",
        marks: 4,
      },
      {
        question:
          "উদ্দীপকের দুইজনের মধ্যে কে বেশিমূল্যের বই কিনেছিল তা ২ এর পরিপূরক পদ্ধতিতে নির্ণয় কর।",
        marks: 4,
      },
    ],
    createdAt: "2025-10-14T03:31:29.397Z",
    updatedAt: "2025-10-16T03:41:29.972Z",
  },
  {
    _id: "68f072aecbe99e7f25dc594c",
    courseId: "68e609e49e158e162999fa2c",
    chapter: "3",
    stimulusType: "image",
    stimulusContent: "https://i.ibb.co.com/kVXGdQvn/sy-2-23.jpg",
    questions: [
      {
        question:
          "উদ্দীপকের ৫ম সংখ্যাটিকে অক্টাল, দশমিক ও হেক্সাডেসিমেল সংখ্যা পদ্ধতিতে রূপান্তর কর।",
        marks: 3,
      },
      {
        question:
          "২-এর পরিপূরক পদ্ধতি ব্যবহার করে উদ্ধীপকের ধারাটির ৪র্থ সংখ্যা থেকে ২য় সংখ্যার পার্থক্য নিরূপন কর।",
        marks: 4,
      },
    ],
    createdAt: "2025-10-16T04:21:02.057Z",
    updatedAt: "2025-10-16T05:04:43.704Z",
  },
];
